Revit 2027 API
IFCOpeningDimensions Properties
The IFCOpeningDimensions type exposes the following members.
Properties
Name | Description
Area |  The area of the opening.
Depth |  The depth of the opening.
HasRectangularDimensions |  True if width and height are valid, false if only area is valid.
Height |  The height of the opening.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Width |  The width of the opening.
Top
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace